Repository: Jibinjohny/finance_management_app
Catalog: lib/l10n/app_*.arb
Languages: ar, bn, gu, kn, ml, mr

# whyLoginLink
source: Why do I need to login?
ar: لماذا أحتاج إلى تسجيل الدخول؟
ml: എന്തുകൊണ്ട് ഞാൻ ലോഗിൻ ചെയ്യണം?

# usernameHint
source: Username
ar: اسم المستخدم
ml: ഉപയോക്തൃനാമം

# passwordHint
source: Password
ar: كلمة المرور
ml: പാസ്‌വേഡ്

# loginButton
source: Login
ar: تسجيل الدخول
ml: ലോഗിൻ

# noAccount
source: Don't have an account?
ar: ليس لديك حساب؟
ml: അക്കൗണ്ട് ഇല്ലേ?

# signUpLink
source: Sign Up
ar: اشتراك
ml: സൈൻ അപ്പ്

source: Invalid credentials
ar: بيانات الاعتماد غير صالحة
ml: തെറ്റായ വിവരങ്ങൾ

# resetDataMessage
source: App data reset. You can now sign up.
ar: تم إعادة تعيين بيانات التطبيق. يمكنك الآن التسجيل.
ml: ആപ്പ് ഡാറ്റ റീസെറ്റ് ചെയ്തു. നിങ്ങൾക്ക് ഇപ്പോൾ സൈൻ അപ്പ് ചെയ്യാം.

# addFirstAccount
source: Tap + to add your first account
ar: اضغط + لإضافة حسابك الأول
ml: നിങ്ങളുടെ ആദ്യ അക്കൗണ്ട് ചേർക്കാൻ + അമർത്തുക

# notificationsTitle
source: Notifications
ar: الإشعارات
ml: അറിയിപ്പുകൾ

source: Clear All
ar: مسح الكل
ml: എല്ലാം മായ്ക്കുക

source: No notifications yet
ar: لا توجد إشعارات حتى الآن
ml: അറിയിപ്പുകളൊന്നുമില്ല

source: Just now
ar: الآن
ml: ഇപ്പോൾ

# minutesAgo
source: {minutes}m ago
ar: منذ {minutes} دقيقة
ml: {minutes} മിനിറ്റ് മുമ്പ്

# hoursAgo
source: {hours}h ago
ar: منذ {hours} ساعة
ml: {hours} മണിക്കൂർ മുമ്പ്

# daysAgo
source: {days}d ago
ar: منذ {days} يوم
ml: {days} ദിവസം മുമ്പ്

source: Account deleted
ar: تم حذف الحساب
ml: അക്കൗണ്ട് നീക്കം ചെയ്തു

# accountDeletedWithTransactions
source: Account deleted along with {count} transaction{s}
ar: تم حذف الحساب مع {count} معاملة
ml: അക്കൗണ്ടും {count} ഇടപാടുകളും നീക്കം ചെയ്തു

source: No data available
ar: لا توجد بيانات متاحة
ml: ഡാറ്റ ലഭ്യമല്ല

# addAccountsAndTransactions
source: Add accounts and transactions to see reports
ar: أضف حسابات ومعاملات لرؤية التقارير
ml: റിപ്പോർട്ടുകൾ കാണാൻ അക്കൗണ്ടുകളും ഇടപാടുകളും ചേർക്കുക

source: Expense Breakdown
ar: تفاصيل المصروفات
ml: ചെലവ് വിവരണം

# noExpensesForPeriod
source: No expenses for this period
ar: لا توجد مصروفات لهذه الفترة
ml: ഈ കാലയളവിൽ ചെലവുകളൊന്നുമില്ല

# generatingPdf
source: Generating PDF to share...
ar: جاري إنشاء ملف PDF للمشاركة...
ml: PDF തയ്യാറാക്കുന്നു...

# errorSharingPdf
source: Error sharing PDF: {error}
ar: خطأ في مشاركة ملف PDF: {error}
ml: PDF പങ്കിടുന്നതിൽ പിശക്: {error}

# backButton
source: Back
ar: رجوع
ml: തിരികെ

# summaryLabel
source: Summary
ar: ملخص
ml: സംഗ്രഹം

# typeLabel
source: Type
ar: النوع
ml: തരം

# tagsOptionalLabel
source: Tags (Optional)
ar: العلامات (اختياري)
ml: ടാഗുകൾ (ഓപ്ഷണൽ)

# paymentModeLabel
source: Payment Mode
ar: طريقة الدفع
ml: പേയ്മെന്റ് രീതി

# paymentModeCash
source: Cash
ar: نقدي
ml: പണം

# paymentModeCreditCard
source: Credit Card
ar: بطاقة ائتمان
ml: ക്രെഡിറ്റ് കാർഡ്

# paymentModeDebitCard
source: Debit Card
ar: بطاقة خصم
ml: ഡെബിറ്റ് കാർഡ്

# paymentModeNetBanking
source: Net Banking
ar: خدمات مصرفية عبر الإنترنت
ml: നെറ്റ് ബാങ്കിംഗ്

# paymentModeOther
source: Other
ar: أخرى
ml: മറ്റുള്ളവ

# categoryFood
source: Food
ar: طعام
ml: ഭക്ഷണം

# categoryTransport
source: Transport
ar: نقل
ml: യാത്ര

# categoryShopping
source: Shopping
ar: تسوق
ml: ഷോപ്പിംഗ്

# categoryBills
source: Bills
ar: فواتير
ml: ബില്ലുകൾ

# categoryEntertainment
source: Entertainment
ar: ترفيه
ml: വിനോദം

# categoryHealth
source: Health
ar: صحة
ml: ആരോഗ്യം

# categoryOther
source: Other
ar: أخرى
ml: മറ്റുള്ളവ

# categorySalary
source: Salary
ar: راتب
ml: ശമ്പളം

# categoryFreelance
source: Freelance
ar: عمل حر
ml: ഫ്രീലാൻസ്

# categoryBusiness
source: Business
ar: عمل تجاري
ml: ബിസിനസ്സ്

# categoryInvestment
source: Investment
ar: استثمار
ml: നിക്ഷേപം

# categoryGift
source: Gift
ar: هدية
ml: സമ്മാനം

# addCategoryTitle
source: Add Category
ar: إضافة فئة
ml: വിഭാഗം ചേർക്കുക

# editCategoryTitle
source: Edit Category
ar: تعديل الفئة
ml: വിഭാഗം എഡിറ്റ് ചെയ്യുക

# categoryNameLabel
source: Category Name
ar: اسم الفئة
ml: വിഭാഗത്തിന്റെ പേര്

# categoryNameError
source: Please enter a category name
ar: يرجى إدخال اسم الفئة
ml: വിഭാഗത്തിന്റെ പേര് നൽകുക

# selectIconLabel
source: Select Icon
ar: اختر أيقونة
ml: ഐക്കൺ തിരഞ്ഞെടുക്കുക

# selectColorLabel
source: Select Color
ar: اختر لون
ml: നിറം തിരഞ്ഞെടുക്കുക

# previewLabel
source: Preview
ar: معاينة
ml: പ്രിവ്യൂ

# saveCategoryButton
source: Save Category
ar: حفظ الفئة
ml: വിഭാഗം സേവ് ചെയ്യുക

# addRecurringTitle
source: New Recurring
ar: تكرار جديد
ml: പുതിയ ആവർത്തന ഇടപാട്

# editRecurringTitle
source: Edit Recurring
ar: تعديل التكرار
ml: ആവർത്തന ഇടപാട് എഡിറ്റ് ചെയ്യുക

# transactionDetailsLabel
source: Transaction Details
ar: تفاصيل المعاملة
ml: ഇടപാട് വിവരങ്ങൾ

# frequencyLabel
source: Frequency
ar: التكرار
ml: ആവർത്തനം

# frequencyDaily
source: Daily
ar: يومي
ml: ദിവസേന

# frequencyWeekly
source: Weekly
ar: أسبوعي
ml: പ്രതിവാരം

# frequencyMonthly
source: Monthly
ar: شهري
ml: പ്രതിമാസം

# frequencyYearly
source: Yearly
ar: سنوي
ml: വർഷം തോറും

# startDateLabel
source: Start Date / Next Due
ar: تاريخ البدء / الاستحقاق القادم
ml: തുടങ്ങുന്ന തീയതി / അടുത്ത തീയതി

# autoAddLabel
source: Auto-add Transaction
ar: إضافة تلقائية
ml: ഓട്ടോ-ആഡ് ഇടപാട്

# autoAddSubtitle
source: Automatically create on due date
ar: إنشاء تلقائي في تاريخ الاستحقاق
ml: നിശ്ചിത തീയതിയിൽ സ്വയമേവ ചേർക്കുക

# saveRecurringButton
source: Save Recurring
ar: حفظ التكرار
ml: ആവർത്തന ഇടപാട് സേവ് ചെയ്യുക

# errorSavingRecurring
source: Error saving recurring transaction: {error}
ar: خطأ في حفظ المعاملة المتكررة: {error}
ml: ആവർത്തന ഇടപാട് സേവ് ചെയ്യുന്നതിൽ പിശക്: {error}

source: Daily
ar: يومي
ml: ദിവസേന

source: Monthly
ar: شهري
ml: പ്രതിമാസം

source: Balance
ar: الرصيد
ml: ബാക്കി

source: Monthly Financial Report
ar: التقرير المالي الشهري
ml: പ്രതിമാസ സാമ്പത്തിക റിപ്പോർട്ട്

# generatedOn
source: Generated on {date}
ar: تم الإنشاء في {date}
ml: തയ്യാറാക്കിയത് {date}

source: Net Balance
ar: صافي الرصيد
ml: അറ്റ ബാക്കി

# dateHeader
source: Date
ar: التاريخ
ml: തീയതി

# modeHeader
source: Mode
ar: الطريقة
ml: രീതി

# descriptionHeader
source: Description
ar: الوصف
ml: വിവരണം

# amountHeader
source: Amount
ar: المبلغ
ml: തുക

source: Data Management
ar: إدارة البيانات

source: Backup Data
ar: نسخ احتياطي للبيانات

source: Restore Data
ar: استعادة البيانات
