Repository: Jibinjohny/finance_management_app
Catalog: lib/l10n/app_*.arb
Languages: ar, bn, gu, kn, ml, mr

source: Dashboard
ar: لوحة القيادة
bn: ড্যাশবোর্ড
gu: ડેશબોર્ડ
kn: ಡ್ಯಾಶ್‌ಬೋರ್ಡ್
ml: ഡാഷ്‌ബോർഡ്
mr: डॅशबोर्ड

source: Transactions
ar: المعاملات
bn: লেনদেন
gu: વ્યવહારો
kn: ವಹಿವಾಟುಗಳು
ml: ഇടപാടുകൾ
mr: व्यवहार

source: Accounts
ar: الحسابات
bn: অ্যাকাউন্ট
gu: ખાતાઓ
kn: ಖಾತೆಗಳು
ml: അക്കൗണ്ടുകൾ
mr: खाती

source: More
ar: المزيد
bn: আরও
gu: વધુ
kn: ಇನ್ನಷ್ಟು
ml: കൂടുതൽ
mr: अधिक

source: Select Language
ar: اختر اللغة
bn: ভাষা নির্বাচন করুন
gu: ભાષા પસંદ કરો
kn: ಭಾಷೆಯನ್ನು ಆಯ್ಕೆಮಾಡಿ
ml: ഭാഷ തിരഞ്ഞെടുക്കുക
mr: भाषा निवडा

source: Search language...
ar: البحث عن لغة...
bn: ভাষা অনুসন্ধান করুন...
gu: ભાષા શોધો...
kn: ಭಾಷೆಯನ್ನು ಹುಡುಕಿ...
ml: ഭാഷ തിരയുക...
mr: भाषा शोधा...

source: Save
ar: حفظ
bn: সংরক্ষণ
gu: સાચવો
kn: ಉಳಿಸಿ
ml: സംരക്ഷിക്കുക
mr: जतन करा

source: Cancel
ar: إلغاء
bn: বাতিল
gu: રદ કરો
kn: ರದ್ದುಮಾಡಿ
ml: റദ്ദാക്കുക
mr: रद्द करा

source: Profile
ar: الملف الشخصي
bn: প্রোফাইল
gu: પ્રોફાઇલ
kn: ಪ್ರೊಫೈಲ್
ml: പ്രൊഫൈൽ
mr: प्रोफाइल

source: Settings
ar: الإعدادات
bn: সেটিংস
gu: સેટિંગ્સ
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
ml: ക്രമീകരണങ്ങൾ
mr: सेटिंग्ज

source: Logout
ar: تسجيل الخروج
bn: লগ আউট
gu: લોગ આઉટ
kn: ಲಾಗ್ ಔಟ್
ml: ലോഗ് ഔട്ട്
mr: लॉग आउट

source: Login
ar: تسجيل الدخول
bn: লগ ইন
gu: લોગ ઇન
kn: ಲಾಗ್ ಇನ್
ml: ലോഗിൻ
mr: लॉग इन

source: Sign Up
ar: اشتراك
bn: সাইন আপ
gu: સાઇન અપ
kn: ಸೈನ್ ಅಪ್
ml: സൈൻ അപ്പ്
mr: साइन अप

source: First Name
ar: الاسم الأول
bn: নাম
gu: પ્રથમ નામ
kn: ಮೊದಲ ಹೆಸರು
ml: പേര്
mr: पहिले नाव

source: Last Name
ar: اسم العائلة
bn: পদবি
gu: છેલ્લું નામ
kn: ಕೊನೆಯ ಹೆಸರು
ml: വീട്ടുപേര്
mr: आडनाव

source: Username
ar: اسم المستخدم
bn: ব্যবহারকারীর নাম
gu: વપરાશકર્તા નામ
kn: ಬಳಕೆದಾರ ಹೆಸರು
ml: ഉപയോക്തൃനാമം
mr: वापरकर्ता नाव

source: Password
ar: كلمة المرور
bn: পাসওয়ার্ড
gu: પાસવર્ડ
kn: ಪಾಸ್‌ವರ್ಡ್
ml: പാസ്‌വേഡ്
mr: पासवर्ड

source: Confirm Password
ar: تأكيد كلمة المرور
bn: পাসওয়ার্ড নিশ্চিত করুন
gu: પાસવર્ડની પુષ્ટિ કરો
kn: ಪಾಸ್‌ವರ್ಡ್ ದೃಢೀಕರಿಸಿ
ml: പാസ്‌വേഡ് സ്ഥിരീകരിക്കുക
mr: पासवर्डची पुष्टी करा

source: Email
ar: البريد الإلكتروني
bn: ইমেল
gu: ઇમેઇલ
kn: ಇಮೇಲ್
ml: ഇമെയിൽ
mr: ईमेल

source: Phone Number
ar: رقم الهاتف
bn: ফোন নম্বর
gu: ફોન નંબર
kn: ಫೋನ್ ಸಂಖ್ಯೆ
ml: ഫോൺ നമ്പർ
mr: फोन नंबर

source: Currency
ar: العملة
bn: মুদ্রা
gu: ચલણ
kn: ಕರೆನ್ಸಿ
ml: കറൻസി
mr: चलन

source: Language
ar: اللغة
bn: ভাষা
gu: ભાષા
kn: ಭಾಷೆ
ml: ഭാഷ
mr: भाषा

source: Theme
ar: الموضوع
bn: থিম
gu: થીમ
kn: ಥೀಮ್
ml: തീം
mr: थीम

source: Notifications
ar: إشعارات
bn: বিজ্ঞপ্তি
gu: સૂચનાઓ
kn: ಅಧಿಸೂಚನೆಗಳು
ml: അറിയിപ്പുകൾ
mr: सूचना

# helpAndSupport
source: Help & Support
ar: المساعدة والدعم
bn: সাহায্য এবং সমর্থন
gu: મદદ અને આધાર
kn: ಸಹಾಯ ಮತ್ತು ಬೆಂಬಲ
ml: സഹായവും പിന്തുണയും
mr: मदत आणि समर्थन

source: Privacy Policy
ar: سياسة الخصوصية
bn: গোপনীয়তা নীতি
gu: ગોપનીયતા નીતિ
kn: ಗೌಪ್ಯತೆ ನೀತಿ
ml: സ്വകാര്യതാ നയം
mr: गोपनीयता धोरण

# privacyContactContent
source: If you have any questions about this privacy policy, please contact us through the app's support section.
ar: إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا من خلال قسم الدعم في التطبيق.
bn: এই গোপনীয়তা নীতি সম্পর্কে আপনার যদি কোন প্রশ্ন থাকে, দয়া করে অ্যাপের সহায়তা বিভাগের মাধ্যমে আমাদের সাথে যোগাযোগ করুন।
gu: જો તમને આ ગોપનીયતા નીતિ વિશે કોઈ પ્રશ્નો હોય, તો કૃપા કરીને એપ્લિકેશનના સપોર્ટ વિભાગ દ્વારા અમારો સંપર્ક કરો.
kn: ಈ ಗೌಪ್ಯತೆ ನೀತಿಯ ಬಗ್ಗೆ ನಿಮಗೆ ಯಾವುದೇ ಪ್ರಶ್ನೆಗಳಿದ್ದರೆ, ದಯವಿಟ್ಟು ಅಪ್ಲಿಕೇಶನ್‌ನ ಬೆಂಬಲ ವಿಭಾಗದ ಮೂಲಕ ನಮ್ಮನ್ನು ಸಂಪರ್ಕಿಸಿ.
ml: ഈ സ്വകാര്യതാ നയത്തെക്കുറിച്ച് നിങ്ങൾക്ക് എന്തെങ്കിലും ചോദ്യങ്ങളുണ്ടെങ്കിൽ, ആപ്പിന്റെ സഹായ വിഭാഗം വഴി ഞങ്ങളെ ബന്ധപ്പെടുക.
mr: आपल्याला या गोपनीयता धोरणाबद्दल काही प्रश्न असल्यास, कृपया अॅपच्या समर्थन विभागाद्वारे आमच्याशी संपर्क साधा.

# addTransactionTitle
source: Add Transaction
ar: إضافة معاملة
bn: লেনদেন যোগ করুন
gu: વ્યવહાર ઉમેરો
kn: ವಹಿವಾಟು ಸೇರಿಸಿ
ml: ഇടപാട് ചേർക്കുക
mr: व्यवहार जोडा

# editTransactionTitle
source: Edit Transaction
ar: تعديل المعاملة
bn: লেনদেন সম্পাদনা করুন
gu: વ્યવહાર સંપાદિત કરો
kn: ವಹಿವಾಟು ಸಂಪಾದಿಸಿ
ml: ഇടപാട് എഡിറ്റ് ചെയ്യുക
mr: व्यवहार संपादित करा

# amountLabel
source: Amount
ar: المبلغ
bn: পরিমাণ
gu: રકમ
kn: ಮೊತ್ತ
ml: തുക
mr: रक्कम

# titleLabel
source: Title
ar: العنوان
bn: শিরোনাম
gu: શીર્ષક
kn: ಶೀರ್ಷಿಕೆ
ml: ശീർഷകം
mr: शीर्षक

# categoryLabel
source: Category
ar: الفئة
bn: বিভাগ
gu: શ્રેણી
kn: ವರ್ಗ
ml: വിഭാഗം
mr: श्रेणी

# dateLabel
source: Date
ar: التاريخ
bn: তারিখ
gu: તારીખ
kn: ದಿನಾಂಕ
ml: തീയതി
mr: तारीख

source: Choose Date
ar: اختر التاريخ
bn: তারিখ নির্বাচন করুন
gu: તારીખ પસંદ કરો
kn: ದಿನಾಂಕ ಆಯ್ಕೆಮಾಡಿ
ml: തീയതി തിരഞ്ഞെടുക്കുക
mr: तारीख निवडा

source: Save Transaction
ar: حفظ المعاملة
bn: লেনদেন সংরক্ষণ করুন
gu: વ્યવહાર સાચવો
kn: ವಹಿವಾಟು ಉಳಿಸಿ
ml: ഇടപാട് സംരക്ഷിക്കുക
mr: व्यवहार जतन करा

source: No Accounts Found
ar: لم يتم العثور على حسابات
bn: কোন অ্যাকাউন্ট পাওয়া যায়নি
gu: કોઈ ખાતાઓ મળ્યા નથી
kn: ಯಾವುದೇ ಖಾತೆಗಳು ಕಂಡುಬಂದಿಲ್ಲ
ml: അക്കൗണ്ടുകളൊന്നും കണ്ടെത്തിയില്ല
mr: कोणतीही खाती आढळली नाहीत

# noAccountsMessage
source: You need to add at least one account before you can create transactions.
ar: تحتاج إلى إضافة حساب واحد على الأقل قبل أن تتمكن من إنشاء معاملات.
bn: লেনদেন তৈরি করার আগে আপনাকে কমপক্ষে একটি অ্যাকাউন্ট যোগ করতে হবে।
gu: વ્યવહાર બનાવવા માટે તમારે ઓછામાં ઓછું એક એકાઉન્ટ ઉમેરવાની જરૂર છે.
kn: ವಹಿವಾಟು ರಚಿಸುವ ಮೊದಲು ನೀವು ಕನಿಷ್ಠ ಒಂದು ಖಾತೆಯನ್ನು ಸೇರಿಸಬೇಕಾಗಿದೆ.
ml: ഇടപാട് സൃഷ്ടിക്കുന്നതിന് മുമ്പ് നിങ്ങൾ കുറഞ്ഞത് ഒരു അക്കൗണ്ടെങ്കിലും ചേർക്കേണ്ടതുണ്ട്.
mr: व्यवहार तयार करण्यापूर्वी आपल्याला किमान एक खाते जोडणे आवश्यक आहे.

# addAccountAction
source: Add Account
ar: إضافة حساب
bn: অ্যাকাউন্ট যোগ করুন
gu: એકાઉન્ટ ઉમેરો
kn: ಖಾತೆ ಸೇರಿಸಿ
ml: അക്കൗണ്ട് ചേർക്കുക
mr: खाते जोडा

# incomeMessage1
source: 🎉 Money in the bank!
ar: 🎉 المال في البنك!
bn: 🎉 ব্যাংকে টাকা এসেছে!
gu: 🎉 બેંકમાં પૈસા આવ્યા!
kn: 🎉 ಬ್ಯಾಂಕ್‌ನಲ್ಲಿ ಹಣ ಬಂದಿದೆ!
ml: 🎉 ബാങ്കിൽ പണം എത്തി!
mr: 🎉 बँकेत पैसे आले!

# incomeMessage2
source: 💰 Cha-ching! Keep it coming!
ar: 💰 تشا-تشينغ! استمر في القدوم!
bn: 💰 ঝনঝন! টাকা আসতেই থাকুক!
gu: 💰 છનન! પૈસા આવવા દો!
kn: 💰 ಝಣಝಣ! ಹಣ ಬರುತ್ತಲೇ ಇರಲಿ!
ml: 💰 കിലുക്കാംപെട്ടി! പണം വന്നുകൊണ്ടേയിരിക്കട്ടെ!
mr: 💰 खणखण! पैसे येऊ द्या!

# incomeMessage3
source: ✨ Your wallet is happy!
ar: ✨ محفظتك سعيدة!
bn: ✨ আপনার মানিব্যাগ খুশি!
gu: ✨ તમારું પાકીટ ખુશ છે!
kn: ✨ ನಿಮ್ಮ ವಾಲೆಟ್ ಸಂತೋಷವಾಗಿದೆ!
ml: ✨ നിങ്ങളുടെ വാലറ്റ് സന്തോഷത്തിലാണ്!
mr: ✨ तुमचे पाकीट आनंदी आहे!

# incomeMessage4
source: 🚀 To the moon!
ar: 🚀 إلى القمر!
bn: 🚀 চাঁদে চললাম!
gu: 🚀 ચંદ્ર પર!
kn: 🚀 ಚಂದ್ರನತ್ತ!
ml: 🚀 ചന്ദ്രനിലേക്ക്!
mr: 🚀 चंद्रावर!

# incomeMessage5
source: 💸 Stack it up!
ar: 💸 كدسها!
bn: 💸 জমা হতে থাকুক!
gu: 💸 ઢગલો કરો!
kn: 💸 ರಾಶಿ ಹಾಕಿ!
ml: 💸 കൂമ്പാരം കൂട്ടൂ!
mr: 💸 ढीग करा!

# incomeMessage6
source: 🔥 You're on fire!
ar: 🔥 أنت مشتعل!
bn: 🔥 আপনি আগুন!
gu: 🔥 તમે આગ લગાવી રહ્યા છો!
kn: 🔥 ನೀವು ಬೆಂಕಿಯಲ್ಲಿದ್ದೀರಿ!
ml: 🔥 നിങ്ങൾ തകർക്കുന്നു!
mr: 🔥 तुम्ही आग लावत आहात!

# incomeMessage7
source: ⭐ Making it rain!
ar: ⭐ اجعلها تمطر!
bn: ⭐ টাকার বৃষ্টি হচ্ছে!
gu: ⭐ પૈસાનો વરસાદ!
kn: ⭐ ಹಣದ ಮಳೆ!
ml: ⭐ പണത്തിന്റെ മഴ!
mr: ⭐ पैशांचा पाऊस!

# incomeMessage8
source: 💎 Diamond hands!
ar: 💎 أيادي الماس!
bn: 💎 ডায়মন্ড হ্যান্ডস!
gu: 💎 ડાયમંડ હેન્ડ્સ!
kn: 💎 ಡೈಮಂಡ್ ಹ್ಯಾಂಡ್ಸ್!
ml: 💎 ഡയമണ്ട് ഹാൻഡ്‌സ്!
mr: 💎 डायमंड हँड्स!

# addAccountTitle
source: Add Account
ar: إضافة حساب
bn: অ্যাকাউন্ট যোগ করুন
gu: એકાઉન્ટ ઉમેરો
kn: ಖಾತೆ ಸೇರಿಸಿ
ml: അക്കൗണ്ട് ചേർക്കുക
mr: खाते जोडा

# editAccountTitle
source: Edit Account
ar: تعديل الحساب
bn: অ্যাকাউন্ট সম্পাদনা করুন
gu: એકાઉન્ટ સંપાદિત કરો
kn: ಖಾತೆ ಸಂಪಾದಿಸಿ
ml: അക്കൗണ്ട് എഡിറ്റ് ചെയ്യുക
mr: खाते संपादित करा

source: Account Details
ar: تفاصيل الحساب
bn: অ্যাকাউন্টের বিবরণ
gu: એકાઉન્ટ વિગતો
kn: ಖಾತೆ ವಿವರಗಳು
ml: അക്കൗണ്ട് വിവരങ്ങൾ
mr: खाते तपशील

# accountNameLabel
source: Account Name
ar: اسم الحساب
bn: অ্যাকাউন্টের নাম
gu: એકાઉન્ટ નામ
kn: ಖಾತೆ ಹೆಸರು
ml: അക്കൗണ്ട് പേര്
mr: खात्याचे नाव

# accountNameHint
source: e.g., Main Wallet
ar: مثل، المحفظة الرئيسية
bn: যেমন: প্রধান মানিব্যাগ
gu: દા.ત., મુખ્ય પાકીટ
kn: ಉದಾ: ಮುಖ್ಯ ವಾಲೆಟ್
ml: ഉദാ: പ്രധാന വാലറ്റ്
mr: उदा: मुख्य पाकीट

# accountNameError
source: Please enter a name
ar: يرجى إدخال اسم
bn: দয়া করে একটি নাম লিখুন
gu: કૃપા કરીને નામ દાખલ કરો
kn: ದಯವಿಟ್ಟು ಹೆಸರನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി പേര് നൽകുക
mr: कृपया नाव प्रविष्ट करा

# accountTypeLabel
source: Account Type
ar: نوع الحساب
bn: অ্যাকাউন্টের ধরন
gu: એકાઉન્ટ પ્રકાર
kn: ಖಾತೆ ಪ್ರಕಾರ
ml: അക്കൗണ്ട് തരം
mr: खाते प्रकार

# initialBalanceLabel
source: Initial Balance
ar: الرصيد الافتتاحي
bn: প্রাথমিক ব্যালেন্স
gu: પ્રારંભિક બેલેન્સ
kn: ಆರಂಭಿಕ ಬಾಕಿ
ml: ആരംഭ ബാലൻസ്
mr: प्रारंभिक शिल्लक

# currentBalanceLabel
source: Current Balance
ar: الرصيد الحالي
bn: বর্তমান ব্যালেন্স
gu: વર્તમાન બેલેન્સ
kn: ಪ್ರಸ್ತುತ ಬಾಕಿ
ml: നിലവിലെ ബാലൻസ്
mr: सध्याची शिल्लक

# creditLimitLabel
source: Credit Limit
ar: الحد الائتماني
bn: ক্রেডিট লিমিট
gu: ક્રેડિટ લિમિટ
kn: ಕ್ರೆಡಿಟ್ ಮಿತಿ
ml: ക്രെഡിറ്റ് പരിധി
mr: क्रेडिट मर्यादा

# balanceError
source: Please enter balance
ar: يرجى إدخال الرصيد
bn: দয়া করে একটি ব্যালেন্স লিখুন
gu: કૃપા કરીને બેલેન્સ દાખલ કરો
kn: ದಯವಿಟ್ಟು ಬಾಕಿಯನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി ബാലൻസ് നൽകുക
mr: कृपया शिल्लक प्रविष्ट करा

# validNumberError
source: Please enter a valid number
ar: يرجى إدخال رقم صحيح
bn: দয়া করে একটি বৈধ সংখ্যা লিখুন
gu: કૃપા કરીને માન્ય નંબર દાખલ કરો
kn: ದಯವಿಟ್ಟು ಮಾನ್ಯ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി സാധുവായ നമ്പർ നൽകുക
mr: कृपया वैध क्रमांक प्रविष्ट करा

source: Bank Details
ar: تفاصيل البنك
bn: ব্যাঙ্কের বিবরণ
gu: બેંક વિગતો
kn: ಬ್ಯಾಂಕ್ ವಿವರಗಳು
ml: ബാങ്ക് വിവരങ്ങൾ
mr: बँक तपशील

source: Card Details
ar: تفاصيل البطاقة
bn: কার্ডের বিবরণ
gu: કાર્ડ વિગતો
kn: ಕಾರ್ಡ್ ವಿವರಗಳು
ml: കാർഡ് വിവരങ്ങൾ
mr: कार्ड तपशील

# bankNameLabel
source: Bank Name
ar: اسم البنك
bn: ব্যাঙ্কের নাম
gu: બેંક નામ
kn: ಬ್ಯಾಂಕ್ ಹೆಸರು
ml: ബാങ്ക് പേര്
mr: बँकेचे नाव

# cardIssuerLabel
source: Card Issuer / Bank
ar: جهة إصدار البطاقة / البنك
bn: কার্ড ইস্যুকারী / ব্যাঙ্ক
gu: કાર્ડ ઇશ્યુઅર / બેંક
kn: ಕಾರ್ಡ್ ವಿತರಕರು / ಬ್ಯಾಂಕ್
ml: കാർഡ് ഇഷ്യൂവർ / ബാങ്ക്
mr: कार्ड जारीकर्ता / बँक

# bankNameHint
source: e.g., HDFC Bank
ar: مثل، البنك الأهلي
bn: যেমন: সোনালী ব্যাংক
gu: દા.ત., એસબીઆઈ
kn: ಉದಾ: ಎಸ್‌ಬಿಐ
ml: ഉദാ: എസ്ബിഐ
mr: उदा: एसबीआय

# bankNameError
source: Please enter bank name
ar: يرجى إدخال اسم البنك
bn: দয়া করে ব্যাঙ্কের নাম লিখুন
gu: કૃપા કરીને બેંકનું નામ દાખલ કરો
kn: ದಯವಿಟ್ಟು ಬ್ಯಾಂಕ್ ಹೆಸರನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി ബാങ്ക് പേര് നൽകുക
mr: कृपया बँकेचे नाव प्रविष्ट करा

# cardIssuerError
source: Please enter card issuer
ar: يرجى إدخال جهة إصدار البطاقة
bn: দয়া করে কার্ড ইস্যুকারীর নাম লিখুন
gu: કૃપા કરીને કાર્ડ ઇશ્યુઅર દાખલ કરો
kn: ದಯವಿಟ್ಟು ಕಾರ್ಡ್ ವಿತರಕರನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി കാർഡ് ഇഷ്യൂവർ നൽകുക
mr: कृपया कार्ड जारीकर्ता प्रविष्ट करा

# accountNumberLabel
source: Account Number
ar: رقم الحساب
bn: অ্যাকাউন্ট নম্বর
gu: એકાઉન્ટ નંબર
kn: ಖಾತೆ ಸಂಖ್ಯೆ
ml: അക്കൗണ്ട് നമ്പർ
mr: खाते क्रमांक

# cardNumberLabel
source: Card Number (Last 4 digits)
ar: رقم البطاقة (آخر 4 أرقام)
bn: কার্ড নম্বর (শেষ ৪টি সংখ্যা)
gu: કાર્ડ નંબર (છેલ્લા ૪ અંકો)
kn: ಕಾರ್ಡ್ ಸಂಖ್ಯೆ (ಕೊನೆಯ ೪ ಅಂಕಿಗಳು)
ml: കാർഡ് നമ്പർ (അവസാന 4 അക്കങ്ങൾ)
mr: कार्ड क्रमांक (शेवटचे ४ अंक)

# cardNumberError
source: Please enter last 4 digits
ar: يرجى إدخال آخر 4 أرقام
bn: দয়া করে শেষ ৪টি সংখ্যা লিখুন
gu: કૃપા કરીને છેલ્લા ૪ અંકો દાખલ કરો
kn: ದಯವಿಟ್ಟು ಕೊನೆಯ ೪ ಅಂಕಿಗಳನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി അവസാന 4 അക്കങ്ങൾ നൽകുക
mr: कृपया शेवटचे ४ अंक प्रविष्ट करा

# cardNumberLengthError
source: Please enter exactly 4 digits
ar: يرجى إدخال 4 أرقام بالضبط
bn: দয়া করে ঠিক ৪টি সংখ্যা লিখুন
gu: કૃપા કરીને બરાબર ૪ અંકો દાખલ કરો
kn: ದಯವಿಟ್ಟು ನಿಖರವಾಗಿ ೪ ಅಂಕಿಗಳನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി കൃത്യം 4 അക്കങ്ങൾ നൽകുക
mr: कृपया नक्की ४ अंक प्रविष्ट करा

source: Loan Details
ar: تفاصيل القرض
bn: ঋণের বিবরণ
gu: લોન વિગતો
kn: ಸಾಲದ ವಿವರಗಳು
ml: വായ്പ വിവരങ്ങൾ
mr: कर्ज तपशील

# loanPrincipalLabel
source: Loan Principal Amount
ar: مبلغ القرض الأصلي
bn: ঋণের আসল
gu: લોન મુદ્દલ
kn: ಸಾಲದ ಅಸಲು
ml: വായ്പ തുക
mr: कर्ज मुद्दल

# loanPrincipalError
source: Please enter principal amount
ar: يرجى إدخال المبلغ الأصلي
bn: দয়া করে আসল পরিমাণ লিখুন
gu: કૃપા કરીને મુદ્દલ દાખલ કરો
kn: ದಯವಿಟ್ಟು ಅಸಲು ನಮೂದಿಸಿ
ml: ദയവായി തുക നൽകുക
mr: कृपया मुद्दल प्रविष्ट करा

# interestRateLabel
source: Interest Rate (% per annum)
ar: معدل الفائدة (% سنوياً)
bn: সুদের হার (বার্ষিক %)
gu: વ્યાજ દર (વાર્ષિક %)
kn: ಬಡ್ಡಿ ದರ (ವಾರ್ಷಿಕ %)
ml: പലിശ നിരക്ക് (വാർഷിക %)
mr: व्याज दर (वार्षिक %)

# interestRateError
source: Please enter interest rate
ar: يرجى إدخال معدل الفائدة
bn: দয়া করে সুদের হার লিখুন
gu: કૃપા કરીને વ્યાજ દર દાખલ કરો
kn: ದಯವಿಟ್ಟು ಬಡ್ಡಿ ದರವನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി പലിശ നിരക്ക് നൽകുക
mr: कृपया व्याज दर प्रविष्ट करा

# loanTenureLabel
source: Loan Tenure (months)
ar: مدة القرض (أشهر)
bn: ঋণের মেয়াদ (মাস)
gu: લોન મુદત (મહિના)
kn: ಸಾಲದ ಅವಧಿ (ತಿಂಗಳುಗಳು)
ml: വായ്പ കാലാവധി (മാസങ്ങൾ)
mr: कर्ज कालावधी (महिने)

# loanTenureError
source: Please enter tenure
ar: يرجى إدخال المدة
bn: দয়া করে মেয়াদ লিখুন
gu: કૃપા કરીને મુદત દાખલ કરો
kn: ದಯವಿಟ್ಟು ಅವಧಿಯನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി കാലാവധി നൽകുക
mr: कृपया कालावधी प्रविष्ट करा

# emiAmountLabel
source: EMI Amount
ar: مبلغ القسط الشهري
bn: ইএমআই পরিমাণ
gu: EMI રકમ
kn: ಇಎಂಐ ಮೊತ್ತ
ml: ഇഎംഐ തുക
mr: ईएमआय रक्कम

# emiAmountError
source: Please enter EMI amount
ar: يرجى إدخال مبلغ القسط الشهري
bn: দয়া করে ইএমআই পরিমাণ লিখুন
gu: કૃપા કરીને EMI રકમ દાખલ કરો
kn: ದಯವಿಟ್ಟು ಇಎಂಐ ಮೊತ್ತವನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി ഇഎംഐ തുക നൽകുക
mr: कृपया ईएमआय रक्कम प्रविष्ट करा

# loanStartDateLabel
source: Loan Start Date
ar: تاريخ بدء القرض
bn: ঋণ শুরুর তারিখ
gu: લોન શરૂઆત તારીખ
kn: ಸಾಲ ಪ್ರಾರಂಭ ದಿನಾಂಕ
ml: വായ്പ ആരംഭ തീയതി
mr: कर्ज सुरू होण्याची तारीख

# emiPaymentDayLabel
source: EMI Payment Day
ar: يوم دفع القسط الشهري
bn: ইএমআই পরিশোধের দিন
gu: EMI ચુકવણી દિવસ
kn: ಇಎಂಐ ಪಾವತಿ ದಿನ
ml: ഇഎംഐ അടയ്ക്കേണ്ട ദിവസം
mr: ईएमआय देय दिवस

# emisPaidLabel
source: EMIs Paid
ar: الأقساط المدفوعة
bn: পরিশোধিত ইএমআই
gu: ચૂકવેલ EMIs
kn: ಪಾವತಿಸಿದ ಇಎಂಐಗಳು
ml: അടച്ച ഇഎംഐകൾ
mr: भरलेले ईएमआय

# emisPaidError
source: Please enter EMIs paid
ar: يرجى إدخال الأقساط المدفوعة
bn: দয়া করে পরিশোধিত ইএমআই লিখুন
gu: કૃપા કરીને ચૂકવેલ EMIs દાખલ કરો
kn: ದಯವಿಟ್ಟು ಪಾವತಿಸಿದ ಇಎಂಐಗಳನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി അടച്ച ഇഎംഐകൾ നൽകുക
mr: कृपया भरलेले ईएमआय प्रविष्ट करा

# emisPendingLabel
source: EMIs Pending (Calculated)
ar: الأقساط المعلقة (محسوبة)
bn: বাকি ইএমআই (গণনা করা)
gu: બાકી EMIs (ગણતરી કરેલ)
kn: ಬಾಕಿ ಇಎಂಐಗಳು (ಲೆಕ್ಕಹಾಕಲಾಗಿದೆ)
ml: ബാക്കി ഇഎംഐകൾ (കണക്കാക്കിയത്)
mr: प्रलंबित ईएमआय (गणना केलेले)

# appearanceLabel
source: Appearance
ar: المظهر
bn: চেহারা
gu: દેખાવ
kn: ಗೋಚರತೆ
ml: രൂപഭാവം
mr: देखावा

# colorLabel
source: Color
ar: اللون
bn: রঙ
gu: રંગ
kn: ಬಣ್ಣ
ml: നിറം
mr: रंग

# iconLabel
source: Icon
ar: الأيقونة
bn: আইকন
gu: આયકન
kn: ಐಕಾನ್
ml: ഐക്കൺ
mr: चिन्ह

# createAccountButton
source: Create Account
ar: إنشاء حساب
bn: অ্যাকাউন্ট তৈরি করুন
gu: એકાઉન્ટ બનાવો
kn: ಖಾತೆ ರಚಿಸಿ
ml: അക്കൗണ്ട് സൃഷ്ടിക്കുക
mr: खाते तयार करा

# saveChangesButton
source: Save Changes
ar: حفظ التغييرات
bn: পরিবর্তন সংরক্ষণ করুন
gu: ફેરફારો સાચવો
kn: ಬದಲಾವಣೆಗಳನ್ನು ಉಳಿಸಿ
ml: മാറ്റങ്ങൾ സംരക്ഷിക്കുക
mr: बदल जतन करा

# cancelButton
source: Cancel
ar: إلغاء
bn: বাতিল
gu: રદ કરો
kn: ರದ್ದುಮಾಡಿ
ml: റദ്ദാക്കുക
mr: रद्द करा

# deleteAccountTitle
source: Delete Account
ar: حذف الحساب
bn: অ্যাকাউন্ট মুছুন
gu: એકાઉન્ટ કાઢી નાખો
kn: ಖಾತೆ ಅಳಿಸಿ
ml: അക്കൗണ്ട് നീക്കം ചെയ്യുക
mr: खाते हटवा

# deleteAccountMessage
source: Are you sure you want to delete "{accountName}"? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف "{accountName}"؟ لا يمكن التراجع عن هذا الإجراء.
bn: আপনি কি নিশ্চিত যে আপনি "{accountName}" মুছতে চান? এই ক্রিয়াটি পূর্বাবস্থায় ফেরানো যাবে না।
gu: શું તમે ખાતરી કરો છો કે તમે "{accountName}" કાઢી નાખવા માંગો છો? આ ક્રિયાને રદ કરી શકાતી નથી.
kn: ನೀವು "{accountName}" ಅನ್ನು ಅಳಿಸಲು ಖಚಿತವಾಗಿದ್ದೀರಾ? ಈ ಕ್ರಿಯೆಯನ್ನು ರದ್ದುಗೊಳಿಸಲಾಗುವುದಿಲ್ಲ.
ml: "{accountName}" നീക്കം ചെയ്യാൻ നിങ്ങൾക്ക് ഉറപ്പാണോ? ഈ പ്രവർത്തനം പഴയപടിയാക്കാൻ കഴിയില്ല.
mr: आपण "{accountName}" हटवू इच्छिता याची आपल्याला खात्री आहे का? ही क्रिया पूर्ववत केली जाऊ शकत नाही.

# deleteAccountWarning
source: Are you sure you want to delete "{accountName}"? This account has {count} transactions. Deleting it will also delete all associated transactions.
ar: هل أنت متأكد أنك تريد حذف "{accountName}"؟ سيؤدي هذا أيضًا إلى حذف {count} معاملة مرتبطة.
bn: আপনি কি নিশ্চিত যে আপনি "{accountName}" মুছতে চান? এটি এর সাথে যুক্ত {count}টি লেনদেনও মুছে ফেলবে।
gu: શું તમે ખાતરી કરો છો કે તમે "{accountName}" કાઢી નાખવા માંગો છો? આ તેની સાથે સંકળાયેલા {count} વ્યવહારો પણ કાઢી નાખશે.
kn: ನೀವು "{accountName}" ಅನ್ನು ಅಳಿಸಲು ಖಚಿತವಾಗಿದ್ದೀರಾ? ಇದು ಅದರೊಂದಿಗೆ ಸಂಬಂಧಿಸಿದ {count} ವಹಿವಾಟುಗಳನ್ನು ಸಹ ಅಳಿಸುತ್ತದೆ.
ml: "{accountName}" നീക്കം ചെയ്യാൻ നിങ്ങൾക്ക് ഉറപ്പാണോ? ഇതുമായി ബന്ധപ്പെട്ട {count} ഇടപാടുകളും നീക്കം ചെയ്യപ്പെടും.
mr: आपण "{accountName}" हटवू इच्छिता याची आपल्याला खात्री आहे का? हे त्याच्याशी संबंधित {count} व्यवहार देखील हटवेल.

# deleteButton
source: Delete
ar: حذف
bn: মুছুন
gu: કાઢી નાખો
kn: ಅಳಿಸಿ
ml: നീക്കം ചെയ്യുക
mr: हटवा

# accountUpdatedSuccess
source: Account updated successfully
ar: تم تحديث الحساب بنجاح
bn: অ্যাকাউন্ট সফলভাবে আপডেট করা হয়েছে
gu: એકાઉન્ટ સફળતાપૂર્વક અપડેટ થયું
kn: ಖಾತೆ ಯಶಸ್ವಿಯಾಗಿ ನವೀಕರಿಸಲಾಗಿದೆ
ml: അക്കൗണ്ട് വിജയകരമായി അപ്‌ഡേറ്റ് ചെയ്തു
mr: खाते यशस्वीरित्या अद्यतनित केले

# accountUpdateError
source: Error updating account: {error}
ar: خطأ في تحديث الحساب: {error}
bn: অ্যাকাউন্ট আপডেট করতে ত্রুটি: {error}
gu: એકાઉન્ટ અપડેટ કરવામાં ભૂલ: {error}
kn: ಖಾತೆ ನವೀಕರಿಸುವಲ್ಲಿ ದೋಷ: {error}
ml: അക്കൗണ്ട് അപ്‌ഡേറ്റ് ചെയ്യുന്നതിൽ പിശക്: {error}
mr: खाते अद्यतनित करण्यात त्रुटी: {error}

# accountTypeCash
source: Cash
ar: نقد
bn: নগদ
gu: રોકડ
kn: ನಗದು
ml: പണം
mr: रोख

# accountTypeSavings
source: Savings
ar: توفير
bn: সঞ্চয়
gu: બચત
kn: ಉಳಿತಾಯ
ml: സേവിംഗ്സ്
mr: बचत

# accountTypeSalary
source: Salary
ar: راتب
bn: বেতন
gu: પગાર
kn: ವೇತನ
ml: ശമ്പളം
mr: पगार

# accountTypeCurrent
source: Current
ar: جاري
bn: চলতি
gu: ચાલુ
kn: ಚಾಲ್ತಿ
ml: കറന്റ്
mr: चालू

# accountTypeCreditCard
source: Credit Card
ar: بطاقة ائتمان
bn: ক্রেডিট কার্ড
gu: ક્રેડિટ કાર્ડ
kn: ಕ್ರೆಡಿಟ್ ಕಾರ್ಡ್
ml: ക്രെഡിറ്റ് കാർഡ്
mr: क्रेडिट कार्ड

# accountTypeBank
source: Bank
ar: بنك
bn: ব্যাঙ্ক
gu: બેંક
kn: ಬ್ಯಾಂಕ್
ml: ബാങ്ക്
mr: बँक

# accountTypeInvestment
source: Investment
ar: استثمار
bn: বিনিয়োগ
gu: રોકાણ
kn: ಹೂಡಿಕೆ
ml: നിക്ഷേപം
mr: गुंतवणूक

# accountTypeLoan
source: Loan
ar: قرض
bn: ঋণ
gu: લોન
kn: ಸಾಲ
ml: വായ്പ
mr: कर्ज

# accountTypeOther
source: Other
ar: آخر
bn: অন্যান্য
gu: અન્ય
kn: ಇತರೆ
ml: മറ്റുള്ളവ
mr: इतर

# selectLabel
source: Select
ar: تحديد
bn: নির্বাচন করুন
gu: પસંદ કરો
kn: ಆಯ್ಕೆಮಾಡಿ
ml: തിരഞ്ഞെടുക്കുക
mr: निवडा

# changeLabel
source: Change
ar: تغيير
bn: পরিবর্তন করুন
gu: બદલો
kn: ಬದಲಾಯಿಸಿ
ml: മാറ്റുക
mr: बदला

source: Not selected
ar: لم يتم التحديد
bn: নির্বাচিত নয়
gu: પસંદ કરેલ નથી
kn: ಆಯ್ಕೆಮಾಡಲಾಗಿಲ್ಲ
ml: തിരഞ്ഞെടുത്തിട്ടില്ല
mr: निवडलेले नाही

# dayLabel
source: Day {day}
ar: اليوم {day}
bn: {day} দিন
gu: {day} દિવસ
kn: {day} ದಿನ
ml: {day}-ാം തീയതി
mr: {day} दिवस

# step1Title
source: Step 1 of 2
ar: الخطوة 1 من 2
bn: ধাপ ১ / ২
gu: પગલું ૧ / ૨
kn: ಹಂತ ೧ / ೨
ml: ഘട്ടം 1 / 2
mr: पाऊल १ / २

# step1Subtitle
source: Basic Details
ar: التفاصيل الأساسية
bn: মৌলিক বিবরণ
gu: મૂળભૂત વિગતો
kn: ಮೂಲ ವಿವರಗಳು
ml: അടിസ്ഥാന വിവരങ്ങൾ
mr: मूलभूत तपशील

# step2Title
source: Step 2 of 2
ar: الخطوة 2 من 2
bn: ধাপ ২ / ২
gu: પગલું ૨ / ૨
kn: ಹಂತ ೨ / ೨
ml: ഘട്ടം 2 / 2
mr: पाऊल २ / २

# step2Subtitle
source: Additional Details
ar: تفاصيل إضافية
bn: আরও বিবরণ
gu: વધુ વિગતો
kn: ಹೆಚ್ಚಿನ ವಿವರಗಳು
ml: കൂടുതൽ വിവരങ്ങൾ
mr: अधिक तपशील

# titleOptionalLabel
source: Title (Optional)
ar: العنوان (اختياري)
bn: শিরোনাম (ঐচ্ছিক)
gu: શીર્ષક (વૈકલ્પિક)
kn: ಶೀರ್ಷಿಕೆ (ಐಚ್ಛಿಕ)
ml: ശീർഷകം (ഓപ്ഷണൽ)
mr: शीर्षक (पर्यायी)

# titleHint
source: e.g., Grocery shopping
ar: مثل، تسوق البقالة
bn: যেমন: মুদি কেনাকাটা
gu: દા.ત., કરિયાણાની ખરીદી
kn: ಉದಾ: ದಿನಸಿ ಶಾಪಿಂಗ್
ml: ഉദാ: പലചരക്ക് സാധനങ്ങൾ
mr: उदा: किराणा खरेदी

# nextButton
source: Next
ar: التالي
bn: পরবর্তী
gu: આગળ
kn: ಮುಂದೆ
ml: അടുത്തത്
mr: पुढील

# selectAccountLabel
source: Select Account
ar: اختر الحساب
bn: অ্যাকাউন্ট নির্বাচন করুন
gu: એકાઉન્ટ પસંદ કરો
kn: ಖಾತೆ ಆಯ್ಕೆಮಾಡಿ
ml: അക്കൗണ്ട് തിരഞ്ഞെടുക്കുക
mr: खाते निवडा

source: No accounts available
ar: لا توجد حسابات متاحة
bn: কোন অ্যাকাউন্ট উপলব্ধ নেই
gu: કોઈ એકાઉન્ટ્સ ઉપલબ્ધ નથી
kn: ಯಾವುದೇ ಖಾತೆಗಳು ಲಭ್ಯವಿಲ್ಲ
ml: അക്കൗണ്ടുകളൊന്നും ലഭ്യമല്ല
mr: कोणतीही खाती उपलब्ध नाहीत

# selectedLabel
source: Selected
ar: محدد
bn: নির্বাচিত
gu: પસંદ કરેલ
kn: ಆಯ್ಕೆಮಾಡಲಾಗಿದೆ
ml: തിരഞ്ഞെടുത്തു
mr: निवडलेले

# tagsLabel
source: Tags
ar: العلامات
bn: ট্যাগ
gu: ટૅગ્સ
kn: ಟ್ಯಾಗ್‌ಗಳು
ml: ടാഗുകൾ
mr: टॅग

# addTagLabel
source: Add Tag
ar: إضافة علامة
bn: ট্যাগ যোগ করুন
gu: ટૅગ ઉમેરો
kn: ಟ್ಯಾಗ್ ಸೇರಿಸಿ
ml: ടാഗ് ചേർക്കുക
mr: टॅग जोडा

# notesLabel
source: Notes
ar: ملاحظات
bn: নোট
gu: નોંધો
kn: ಟಿಪ್ಪಣಿಗಳು
ml: കുറിപ്പുകൾ
mr: टिपा

# notesHint
source: Add notes about this transaction
ar: أضف ملاحظات حول هذه المعاملة
bn: এই লেনদেনের জন্য নোট যোগ করুন
gu: આ વ્યવહાર માટે નોંધો ઉમેરો
kn: ಈ ವಹಿವಾಟಿಗೆ ಟಿಪ್ಪಣಿಗಳನ್ನು ಸೇರಿಸಿ
ml: ഈ ഇടപാടിനായി കുറിപ്പുകൾ ചേർക്കുക
mr: या व्यवहारासाठी टिपा जोडा

# enterAmountError
source: Please enter an amount
ar: يرجى إدخال مبلغ
bn: দয়া করে একটি পরিমাণ লিখুন
gu: કૃપા કરીને રકમ દાખલ કરો
kn: ದಯವಿಟ್ಟು ಮೊತ್ತವನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി തുക നൽകുക
mr: कृपया रक्कम प्रविष्ट करा

# validAmountError
source: Please enter a valid amount
ar: يرجى إدخال مبلغ صحيح
bn: দয়া করে একটি বৈধ পরিমাণ লিখুন
gu: કૃપા કરીને માન્ય રકમ દાખલ કરો
kn: ದಯವಿಟ್ಟು ಮಾನ್ಯ ಮೊತ್ತವನ್ನು ನಮೂದಿಸಿ
ml: ദയവായി സാധുവായ തുക നൽകുക
mr: कृपया वैध रक्कम प्रविष्ट करा

# selectAccountError
source: Please select an account
ar: يرجى اختيار حساب
bn: দয়া করে একটি অ্যাকাউন্ট নির্বাচন করুন
gu: કૃપા કરીને એકાઉન્ટ પસંદ કરો
kn: ದಯವಿಟ್ಟು ಖಾತೆಯನ್ನು ಆಯ್ಕೆಮಾಡಿ
ml: ദയവായി അക്കൗണ്ട് തിരഞ്ഞെടുക്കുക
mr: कृपया खाते निवडा

# transactionAddedSuccess
source: Transaction added successfully!
ar: تمت إضافة المعاملة بنجاح!
bn: লেনদেন সফলভাবে যোগ করা হয়েছে!
gu: વ્યવહાર સફળતાપૂર્વક ઉમેરાયો!
kn: ವಹಿವಾಟು ಯಶಸ್ವಿಯಾಗಿ ಸೇರಿಸಲಾಗಿದೆ!
ml: ഇടപാട് വിജയകരമായി ചേർത്തു!
mr: व्यवहार यशस्वीरित्या जोडला!

# termsTitle
source: Terms & Conditions
ar: الشروط والأحكام
bn: শর্তাবলী
gu: નિયમો અને શરતો
kn: ನಿಯಮಗಳು ಮತ್ತು ಷರತ್ತುಗಳು
ml: നിബന്ധനകളും വ്യവസ്ഥകളും
mr: अटी आणि शर्ती

# termsAndConditions
source: Terms & Conditions
ar: الشروط والأحكام
bn: শর্তাবলী
kn: ನಿಯಮಗಳು ಮತ್ತು ಷರತ್ತುಗಳು
ml: നിബന്ധനകളും വ്യവസ്ഥകളും
mr: अटी आणि शर्ती

source: About
ar: حول
bn: সম্পর্কে
gu: વિશે
kn: ಬಗ್ಗೆ
ml: കുറിച്ച്
mr: बद्दल

source: Version
ar: الإصدار
bn: সংস্করণ
gu: આવૃત્તિ
kn: ಆವೃತ್ತಿ
ml: പതിപ്പ്
mr: आवृत्ती

source: Create Account
ar: إنشاء حساب
bn: অ্যাকাউন্ট তৈরি করুন
gu: ખાતું બનાવો
kn: ಖಾತೆ ರಚಿಸಿ
ml: അക്കൗണ്ട് സൃഷ്ടിക്കുക
mr: खाते तयार करा

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟
bn: ইতিমধ্যে একটি অ্যাকাউন্ট আছে?
gu: શું તમારી પાસે પહેલાથી જ ખાતું છે?
kn: ಈಗಾಗಲೇ ಖಾತೆ ಇದೆಯೇ?
ml: ഇതിനകം അക്കൗണ്ട് ഉണ്ടോ?
mr: आधीच खाते आहे का?

# whyNeedSignup
source: Why do I need to sign up?
ar: لماذا أحتاج إلى التسجيل؟
bn: কেন আমাকে সাইন আপ করতে হবে?
gu: મારે શા માટે સાઇન અપ કરવાની જરૂર છે?
kn: ನಾನು ಏಕೆ ಸೈನ್ ಅಪ್ ಮಾಡಬೇಕು?
ml: ഞാൻ എന്തിന് സൈൻ അപ്പ് ചെയ്യണം?
mr: मला साइन अप करण्याची आवश्यकता का आहे?

source: Hello
ar: مرحبا
bn: হ্যালো
gu: નમસ્તે
kn: ನಮಸ್ಕಾರ
ml: ഹലോ
mr: नमस्कार

source: Welcome back
ar: مرحبًا بعودتك
bn: স্বাগতম
gu: ફરી સ્વાગત છે
kn: ಮರಳಿ ಸ್ವಾಗತ
ml: സ്വാഗതം
mr: परत स्वागत आहे

source: Net Worth
ar: صافي الثروة
bn: মোট সম্পদ
gu: નેટ વર્થ
kn: ನಿವ್ವಳ ಮೌಲ್ಯ
ml: ആസ്തി
mr: निव्वळ संपत्ती

source: Financial Planning
ar: التخطيط المالي
bn: আর্থিক পরিকল্পনা
gu: નાણાકીય આયોજન
kn: ಹಣಕಾಸು ಯೋಜನೆ
ml: സാമ്പത്തിക ആസൂത്രണം
mr: आर्थिक नियोजन

source: Budgets
ar: الميزانيات
bn: বাজেট
gu: બજેટ
kn: ಬಜೆಟ್‌ಗಳು
ml: ബജറ്റുകൾ
mr: बजेट

source: Goals
ar: الأهداف
bn: লক্ষ্য
gu: લક્ષ્યો
kn: ಗುರಿಗಳು
ml: ലക്ഷ്യങ്ങൾ
mr: ध्येय

source: Categories
ar: الفئات
bn: বিভাগ
gu: શ્રેણીઓ
kn: ವರ್ಗಗಳು
ml: വിഭാഗങ്ങൾ
mr: श्रेण्या

source: Recurring
ar: المتكررة
bn: পুনরাবৃত্ত
gu: પુનરાવર્તિત
kn: ಮರುಕಳಿಸುವ
ml: ആവർത്തിക്കുന്നത്
mr: आवर्ती

source: Calendar
ar: التقويم
bn: ক্যালেন্ডার
gu: કેલેન્ડર
kn: ಕ್ಯಾಲೆಂಡರ್
ml: കലണ്ടർ
mr: कॅलेंडर

source: Insights
ar: رؤى
bn: অন্তর্দৃষ্টি
gu: આંતરદૃષ્ટિ
kn: ಒಳನೋಟಗಳು
ml: ഉൾക്കാഴ്ചകൾ
mr: अंतर्दृष्टी

source: Tags
ar: العلامات
bn: ট্যাগ
gu: ટૅગ્સ
kn: ಟ್ಯಾಗ್‌ಗಳು
ml: ടാഗുകൾ
mr: टॅग

source: My Accounts
ar: حساباتي
bn: আমার অ্যাকাউন্ট
gu: મારા ખાતાઓ
kn: ನನ್ನ ಖಾತೆಗಳು
ml: എന്റെ അക്കൗണ്ടുകൾ
mr: माझी खाती
