Repository: Jibinjohny/finance_management_app
Catalog: lib/l10n/app_*.arb
Languages: ar, bn, gu, kn, ml, mr

source: No accounts yet
ar: لا توجد حسابات بعد
bn: এখনও কোন অ্যাকাউন্ট নেই
gu: હજુ સુધી કોઈ ખાતું નથી
kn: ಇನ್ನೂ ಯಾವುದೇ ಖಾತೆಗಳಿಲ್ಲ
ml: ഇതുവരെ അക്കൗണ്ടുകളൊന്നുമില്ല
mr: अद्याप कोणतीही खाती नाहीत

source: Overview
ar: نظرة عامة
bn: ওভারভিউ
gu: ઝાંખી
kn: ಅವಲೋಕನ
ml: അവലോകനം
mr: आढावा

source: Top Expenses
ar: أعلى النفقات
bn: শীর্ষ ব্যয়
gu: ટોચના ખર્ચ
kn: ಅಗ್ರ ವೆಚ್ಚಗಳು
ml: മുൻനിര ചെലവുകൾ
mr: शीर्ष खर्च

source: No expenses yet
ar: لا توجد نفقات بعد
bn: এখনও কোন খরচ নেই
gu: હજુ સુધી કોઈ ખર્ચ નથી
kn: ಇನ್ನೂ ಯಾವುದೇ ವೆಚ್ಚಗಳಿಲ್ಲ
ml: ഇതുവരെ ചെലവുകളൊന്നുമില്ല
mr: अद्याप कोणताही खर्च नाही

source: Recent Transactions
ar: المعاملات الأخيرة
bn: সাম্প্রতিক লেনদেন
gu: તાજેતરના વ્યવહારો
kn: ಇತ್ತೀಚಿನ ವಹಿವಾಟುಗಳು
ml: സമീപകാല ഇടപാടുകൾ
mr: अलीकडील व्यवहार

source: View All
ar: عرض الكل
bn: সব দেখুন
gu: બધું જુઓ
kn: ಎಲ್ಲವನ್ನೂ ವೀಕ್ಷಿಸಿ
ml: എല്ലാം കാണുക
mr: सर्व पहा

source: No recent transactions
ar: لا توجد معاملات حديثة
bn: কোন সাম্প্রতিক লেনদেন নেই
gu: કોઈ તાજેતરના વ્યવહારો નથી
kn: ಯಾವುದೇ ಇತ್ತೀಚಿನ ವಹಿವಾಟುಗಳಿಲ್ಲ
ml: സമീപകാല ഇടപാടുകളൊന്നുമില്ല
mr: कोणतेही अलीकडील व्यवहार नाहीत

source: Filter by Tags
ar: تصفية حسب العلامات
bn: ট্যাগ দ্বারা ফিল্টার
gu: ટૅગ્સ દ્વારા ફિલ્ટર કરો
kn: ಟ್ಯಾಗ್‌ಗಳ ಮೂಲಕ ಫಿಲ್ಟರ್ ಮಾಡಿ
ml: ടാഗുകൾ പ്രകാരം ഫിൽട്ടർ ചെയ്യുക
mr: टॅगनुसार फिल्टर करा

source: Clear
ar: مسح
bn: মুছে ফেলুন
gu: સાફ કરો
kn: ಅಳಿಸಿ
ml: ക്ലിയർ
mr: साफ करा

source: No tags available
ar: لا توجد علامات متاحة
bn: কোন ট্যাগ উপলব্ধ নেই
gu: કોઈ ટૅગ્સ ઉપલબ્ધ નથી
kn: ಯಾವುದೇ ಟ್ಯಾಗ್‌ಗಳು ಲಭ್ಯವಿಲ್ಲ
ml: ടാഗുകളൊന്നും ലഭ്യമല്ല
mr: कोणतेही टॅग उपलब्ध नाहीत

source: Done
ar: تم
bn: সম্পন্ন
gu: થઈ ગયું
kn: ಮುಗಿದಿದೆ
ml: പൂർത്തിയായി
mr: झाले

source: All Transactions
ar: جميع المعاملات
bn: সমস্ত লেনদেন
gu: બધા વ્યવહારો
kn: ಎಲ್ಲಾ ವಹಿವಾಟುಗಳು
ml: എല്ലാ ഇടപാടുകളും
mr: सर्व व्यवहार

source: All
ar: الكل
bn: সব
gu: બધું
kn: ಎಲ್ಲಾ
ml: എല്ലാം
mr: सर्व

source: Income
ar: الدخل
bn: আয়
gu: આવક
kn: ಆದಾಯ
ml: വരുമാനം
mr: उत्पन्न

source: Expense
ar: المصروفات
bn: ব্যয়
gu: ખર્ચ
kn: ವೆಚ್ಚ
ml: ചെലവ്
mr: खर्च

source: No transactions found
ar: لم يتم العثور على معاملات
bn: কোন লেনদেন পাওয়া যায়নি
gu: કોઈ વ્યવહારો મળ્યા નથી
kn: ಯಾವುದೇ ವಹಿವಾಟುಗಳು ಕಂಡುಬಂದಿಲ್ಲ
ml: ഇടപാടുകളൊന്നും കണ്ടെത്തിയില്ല
mr: कोणतेही व्यवहार आढळले नाहीत

source: Delete Transaction
ar: حذف المعاملة
bn: লেনদেন মুছুন
gu: વ્યવહાર કાઢી નાખો
kn: ವಹಿವಾಟನ್ನು ಅಳಿಸಿ
ml: ഇടപാട് നീക്കം ചെയ്യുക
mr: व्यवहार हटवा

# deleteTransactionConfirmation
source: Are you sure you want to delete "{title}"?
ar: هل أنت متأكد أنك تريد حذف "{title}"؟
bn: আপনি কি নিশ্চিত যে আপনি "{title}" মুছতে চান?
gu: શું તમે ખરેખર "{title}" કાઢી નાખવા માંગો છો?
kn: ನೀವು ಖಂಡಿತವಾಗಿಯೂ "{title}" ಅನ್ನು ಅಳಿಸಲು ಬಯಸುವಿರೇ?
ml: "{title}" നീക്കം ചെയ്യണമെന്ന് നിങ്ങൾക്ക് ഉറപ്പാണോ?
mr: तुम्हाला खात्री आहे की तुम्ही "{title}" हटवू इच्छिता?

source: Transaction deleted
ar: تم حذف المعاملة
bn: লেনদেন মুছে ফেলা হয়েছে
gu: વ્યવહાર કાઢી નાખ્યો
kn: ವಹಿವಾಟು ಅಳಿಸಲಾಗಿದೆ
ml: ഇടപാട് നീക്കം ചെയ്തു
mr: व्यवहार हटविला

source: Statistics
ar: الإحصائيات
bn: পরিসংখ্যান
gu: આંકડા
kn: ಅಂಕಿಅಂಶಗಳು
ml: സ്ഥിതിവിവരക്കണക്കുകൾ
mr: आकडेवारी

source: All Accounts
ar: جميع الحسابات
bn: সমস্ত অ্যাকাউন্ট
gu: બધા ખાતાઓ
kn: ಎಲ್ಲಾ ಖಾತೆಗಳು
ml: എല്ലാ അക്കൗണ്ടുകളും
mr: सर्व खाती

source: Income vs Expense
ar: الدخل مقابل المصروفات
bn: আয় বনাম ব্যয়
gu: આવક વિ ખર્ચ
kn: ಆದಾಯ vs ವೆಚ್ಚ
ml: വരുമാനം vs ചെലവ്
mr: उत्पन्न वि खर्च

# financialTrend
source: Financial Trend (Last 6 Months)
ar: الاتجاه المالي (آخر 6 أشهر)
bn: আর্থিক প্রবণতা (গত 6 মাস)
gu: નાણાકીય વલણ (છેલ્લા 6 મહિના)
kn: ಹಣಕಾಸು ಪ್ರವೃತ್ತಿ (ಕಳೆದ 6 ತಿಂಗಳುಗಳು)
ml: സാമ്പത്തിക പ്രവണത (കഴിഞ്ഞ 6 മാസം)
mr: आर्थिक कल (गेल्या 6 महिने)

source: Total Income
ar: إجمالي الدخل
bn: মোট আয়
gu: કુલ આવક
kn: ಒಟ್ಟು ಆದಾಯ
ml: ആകെ വരുമാനം
mr: एकूण उत्पन्न

source: Total Expense
ar: إجمالي المصروفات
bn: মোট ব্যয়
gu: કુલ ખર્ચ
kn: ಒಟ್ಟು ವೆಚ್ಚ
ml: ആകെ ചെലവ്
mr: एकूण खर्च

source: Total Balance
ar: إجمالي الرصيد
bn: মোট ব্যালেন্স
gu: કુલ બેલેન્સ
kn: ಒಟ್ಟು ಬಾಕಿ
ml: ആകെ ബാലൻസ്
mr: एकूण शिल्लक

source: Spending by Tags
ar: الإنفاق حسب العلامات
bn: ট্যাগ দ্বারা ব্যয়
gu: ટૅગ્સ દ્વારા ખર્ચ
kn: ಟ್ಯಾಗ್‌ಗಳ ಮೂಲಕ ವೆಚ್ಚ
ml: ടാഗുകൾ പ്രകാരമുള്ള ചെലവ്
mr: टॅगनुसार खर्च

source: Account Breakdown
ar: تفاصيل الحساب
bn: অ্যাকাউন্ট ব্রেকডাউন
gu: ખાતાનું વિવરણ
kn: ಖಾತೆ ವಿವರ
ml: അക്കൗണ്ട് വിവരണം
mr: खाते तपशील

source: Monthly Report
ar: التقرير الشهري
ml: പ്രതിമാസ റിപ്പോർട്ട്

# faqTitle
source: FAQ
ar: الأسئلة الشائعة
ml: ചോദ്യോത്തരങ്ങൾ

# faqSearchHint
source: Search FAQ...
ar: البحث في الأسئلة الشائعة...
ml: ചോദ്യങ്ങൾ തിരയുക...

# faqNoResults
source: No results found
ar: لم يتم العثور على نتائج
ml: ഫലങ്ങളൊന്നും കണ്ടെത്തിയില്ല

# faqQ1
source: How do I create a new account?
ar: كيف يمكنني إضافة معاملة؟
ml: എങ്ങനെ പുതിയ അക്കൗണ്ട് സൃഷ്ടിക്കാം?

# faqA1
source: Go to the Accounts tab and tap the "+" button. Enter your account name, select an icon and color, then set the initial balance. You can create multiple accounts for different purposes like bank accounts, cash, credit cards, etc.
ar: اضغط على زر '+' في الشاشة الرئيسية، أدخل المبلغ، اختر الفئة، واضغط حفظ.
ml: അക്കൗണ്ട്സ് ടാബിൽ പോയി "+" ബട്ടൺ അമർത്തുക. അക്കൗണ്ട് പേര് നൽകുക, ഐക്കണും നിറവും തിരഞ്ഞെടുക്കുക, തുടർന്ന് ആരംഭ ബാലൻസ് സജ്ജമാക്കുക.

# faqQ2
source: How do I add a transaction?
ar: هل يمكنني تعديل معاملة؟
ml: എങ്ങനെ ഇടപാട് ചേർക്കാം?

# faqA2
source: Tap the "+" floating action button on the home screen. Select whether it's income or expense, enter the amount, title, category, and date. Make sure you have at least one account created before adding transactions.
ar: نعم، اضغط على أي معاملة في القائمة لتعديل تفاصيلها.
ml: ഹോം സ്ക്രീനിലെ "+" ബട്ടൺ അമർത്തുക. വരുമാനമാണോ ചെലവാണോ എന്ന് തിരഞ്ഞെടുക്കുക, തുക, ശീർഷകം, വിഭാഗം, തീയതി എന്നിവ നൽകുക.

# faqQ3
source: Can I edit or delete transactions?
ar: كيف يمكنني حذف حساب؟
ml: ഇടപാടുകൾ എഡിറ്റ് ചെയ്യാനോ നീക്കം ചെയ്യാനോ കഴിയുമോ?

# faqA3
source: Yes! Go to the Transactions screen, find the transaction you want to modify, and tap on it. You can either edit the details or delete it using the delete button.
ar: اذهب إلى شاشة الحسابات، اضغط مطولاً على الحساب الذي تريد حذفه، وأكد الحذف.
ml: അതെ! ഇടപാടുകൾ സ്ക്രീനിൽ പോയി, നിങ്ങൾക്ക് മാറ്റം വരുത്തേണ്ട ഇടപാട് കണ്ടെത്തുക. അതിൽ അമർത്തി എഡിറ്റ് ചെയ്യുകയോ നീക്കം ചെയ്യുകയോ ചെയ്യാം.

# faqQ4
source: What are categories and how do I use them?
ar: هل بياناتي آمنة؟
ml: വിഭാഗങ്ങൾ എന്താണ്, അവ എങ്ങനെ ഉപയോഗിക്കാം?

# faqA4
source: Categories help you organize your transactions. For expenses, you can use categories like Food, Transport, Shopping, Bills, etc. For income, categories include Salary, Freelance, Business, etc. Select the appropriate category when adding a transaction.
ar: نعم، يتم تخزين بياناتك محلياً على جهازك ولا يتم مشاركتها مع أي خوادم خارجية.
ml: നിങ്ങളുടെ ഇടപാടുകൾ തരംതിരിക്കാൻ വിഭാഗങ്ങൾ സഹായിക്കുന്നു. ഭക്ഷണത്തിനും യാത്രയ്ക്കും മറ്റും വെവ്വേറെ വിഭാഗങ്ങൾ ഉപയോഗിക്കാം.

# faqQ5
source: How do I create and manage budgets?
ar: كيف يمكنني تغيير العملة؟
ml: ബജറ്റുകൾ എങ്ങനെ സൃഷ്ടിക്കാം?

# faqA5
source: Go to the Budgets screen from the dashboard. Tap "+" to create a new budget. You can set a limit for a specific category and time period (weekly, monthly, etc.). To edit or delete, tap on an existing budget.
ar: اذهب إلى الإعدادات > العملة واختر العملة المفضلة لديك.
ml: ഡാഷ്‌ബോർഡിൽ നിന്ന് ബജറ്റ് സ്ക്രീനിലേക്ക് പോകുക. "+" അമർത്തി പുതിയ ബജറ്റ് ചേർക്കുക. നിങ്ങൾക്ക് ഒരു വിഭാഗത്തിനും സമയപരിധിക്കും പരിധി നിശ്ചയിക്കാം.

# faqQ6
source: How do I set financial goals?
ar: هل يمكنني تصدير بياناتي؟
ml: സാമ്പത്തിക ലക്ഷ്യങ്ങൾ എങ്ങനെ സജ്ജമാക്കാം?

# faqA6
source: Navigate to the Goals screen. Tap "+" to add a goal (e.g., "New Car"). Set a target amount and target date. You can then "Add Funds" to the goal from your accounts to track your progress.
ar: نعم، يمكنك تصدير تقاريرك الشهرية كملف PDF من شاشة التقارير.
ml: ലക്ഷ്യങ്ങൾ സ്ക്രീനിലേക്ക് പോകുക. "+" അമർത്തി ലക്ഷ്യം ചേർക്കുക (ഉദാ: പുതിയ കാർ). ലക്ഷ്യ തുകയും തീയതിയും നൽകുക.

# faqQ7
source: How do I set up recurring transactions?
ar: كيف أضيف فئة جديدة؟
ml: ആവർത്തിക്കുന്ന ഇടപാടുകൾ എങ്ങനെ സജ്ജമാക്കാം?

# faqA7
source: Go to the Recurring Transactions screen. Tap "+" to create a new recurring income or expense. Set the amount, frequency (e.g., monthly), and next due date. You can also enable "Auto-add" to have them added automatically.
ar: اذهب إلى الإعدادات > الفئات واضغط على زر الإضافة لإنشاء فئة جديدة.
ml: ആവർത്തിക്കുന്ന ഇടപാടുകൾ സ്ക്രീനിൽ പോകുക. "+" അമർത്തി പുതിയ വരുമാനമോ ചെലവോ ചേർക്കുക. തുക, ആവർത്തനം, അടുത്ത തീയതി എന്നിവ നൽകുക.

# faqQ8
source: How does the Calendar view work?
ar: هل يدعم التطبيق الوضع المظلم؟
ml: കലണ്ടർ വ്യൂ എങ്ങനെ പ്രവർത്തിക്കുന്നു?

# faqA8
source: The Calendar screen shows your transactions on a monthly calendar. Dates with transactions are marked. Tapping a date shows the transactions for that specific day.
ar: نعم، يمكنك تفعيل الوضع المظلم من الإعدادات > المظهر.
ml: കലണ്ടർ സ്ക്രീൻ നിങ്ങളുടെ ഇടപാടുകൾ മാസടിസ്ഥാനത്തിൽ കാണിക്കുന്നു. ഇടപാടുകളുള്ള തീയതികൾ അടയാളപ്പെടുത്തിയിരിക്കും.

# faqQ9
source: How do I view my spending reports?
ar: كيف يمكنني تعيين ميزانية؟
ml: ചെലവ് റിപ്പോർട്ടുകൾ എങ്ങനെ കാണാം?

# faqA9
source: Navigate to the Monthly Report screen from the bottom navigation. You'll see charts showing your income vs expenses, category-wise breakdown, and transaction history for the selected month.
ar: اذهب إلى قسم الميزانيات من الشاشة الرئيسية واضغط على زر الإضافة لتعيين ميزانية جديدة.
ml: പ്രതിമാസ റിപ്പോർട്ട് സ്ക്രീനിലേക്ക് പോകുക. അവിടെ വരുമാനം vs ചെലവ്, വിഭാഗം തിരിച്ചുള്ള കണക്കുകൾ എന്നിവ കാണാം.

# faqQ10
source: What is Net Worth and how is it calculated?
ar: ما هي المعاملات المتكررة؟
ml: ആസ്തി (Net Worth) എന്നാൽ എന്താണ്?

# faqA10
source: Net Worth is the total of all your account balances. It's calculated by adding up the current balance of all your accounts. You can view the Net Worth chart on the home screen to see trends over time.
ar: هي المعاملات التي تتكرر بانتظام مثل الإيجار أو الاشتراكات. يمكنك إعدادها من قسم المعاملات المتكررة.
ml: നിങ്ങളുടെ എല്ലാ അക്കൗണ്ടുകളിലെയും ബാലൻസ് ചേർത്തതാണ് ആസ്തി. ഹോം സ്ക്രീനിൽ ഇതിന്റെ ചാർട്ട് കാണാം.

# faqQ11
source: How do I export my data?
ar: كيف أرى تقريري الشهري؟
ml: ഡാറ്റ എങ്ങനെ എക്സ്പോർട്ട് ചെയ്യാം?

# faqA11
source: Go to the Monthly Report screen and tap the export button. You can generate a PDF report of your transactions for the selected month, which can be saved or shared.
ar: اضغط على أيقونة التقارير في شريط التنقل السفلي لعرض ملخصك الشهري.
ml: പ്രതിമാസ റിപ്പോർട്ട് സ്ക്രീനിൽ പോയി എക്സ്പോർട്ട് ബട്ടൺ അമർത്തുക. നിങ്ങൾക്ക് PDF റിപ്പോർട്ട് ലഭിക്കും.

# faqQ12
source: How do I enable notifications?
ar: هل يمكنني استخدام التطبيق بدون إنترنت؟
ml: അറിയിപ്പുകൾ എങ്ങനെ എനേബിൾ ചെയ്യാം?

# faqA12
source: Go to the Notifications screen from the bottom navigation. You can create custom reminders for bills, savings goals, or any other financial tasks. Set the title, time, and frequency.
ar: نعم، التطبيق يعمل بشكل كامل بدون اتصال بالإنترنت.
ml: അറിയിപ്പുകൾ സ്ക്രീനിലേക്ക് പോകുക. ബില്ലുകൾക്കും മറ്റും ഓർമ്മപ്പെടുത്തലുകൾ സൃഷ്ടിക്കാം.

# faqQ13
source: Is my data secure?
ar: كيف أتواصل مع الدعم؟
ml: എന്റെ ഡാറ്റ സുരക്ഷിതമാണോ?

# faqA13
source: Yes! All your data is stored locally on your device using encrypted SQLite database. Your financial information never leaves your device unless you explicitly export it.
ar: يمكنك التواصل معنا عبر البريد الإلكتروني الموجود في قسم المساعدة والدعم.
ml: അതെ! നിങ്ങളുടെ ഡാറ്റ നിങ്ങളുടെ ഫോണിൽ മാത്രമാണ് സൂക്ഷിക്കുന്നത്. നിങ്ങൾ എക്സ്പോർട്ട് ചെയ്താൽ മാത്രമേ പുറത്തുപോകൂ.

# faqQ14
source: Can I use the app on multiple devices?
ar: هل يمكنني قفل التطبيق؟
ml: ഒന്നിലധികം ഫോണുകളിൽ ഉപയോഗിക്കാമോ?

# faqA14
source: Currently, the app stores data locally on your device. Cloud sync is not available yet, so data won't automatically transfer between devices.
ar: نعم، يمكنك تفعيل قفل التطبيق (بصمة الإصبع أو الوجه) من الإعدادات > الأمان.
ml: നിലവിൽ ഇല്ല. ഡാറ്റ ഫോണിൽ മാത്രമാണ് സൂക്ഷിക്കുന്നത്.

# faqQ15
source: How do I backup my data?
ar: كيف أحذف جميع بياناتي؟
ml: ഡാറ്റ ബാക്കപ്പ് എങ്ങനെ ചെയ്യാം?

# faqA15
source: You can export your monthly reports as PDF files. For complete data backup, use your device's backup features (iCloud for iOS, Google Drive for Android) which will include the app's local database.
ar: يمكنك إعادة تعيين التطبيق وحذف جميع البيانات من الإعدادات > إدارة البيانات > حذف جميع البيانات.
ml: റിപ്പോർട്ടുകൾ PDF ആയി എക്സ്പോർട്ട് ചെയ്യാം. ഫോണിന്റെ ബാക്കപ്പ് സംവിധാനം ഉപയോഗിച്ചും ഡാറ്റ സംരക്ഷിക്കാം.

# faqQ16
source: What should I do if I see an error?
ar: هل التطبيق مجاني؟
ml: എറർ കണ്ടാൽ എന്ത് ചെയ്യണം?

# faqA16
source: Try restarting the app first. If the issue persists, check that you have the latest version installed. For persistent problems, you can reset the database from the login screen (this will delete all data, so export reports first).
ar: نعم، التطبيق مجاني للاستخدام مع ميزات أساسية.
ml: ആപ്പ് റീസ്റ്റാർട്ട് ചെയ്തു നോക്കുക. അല്ലെങ്കിൽ ലോഗിൻ സ്ക്രീനിൽ നിന്ന് ഡാറ്റ റീസെറ്റ് ചെയ്യാം (ഇത് എല്ലാ ഡാറ്റയും കളയും).

# faqQ17
source: How do I update the app?
ar: كيف أقوم بتحديث التطبيق؟
ml: ആപ്പ് എങ്ങനെ അപ്‌ഡേറ്റ് ചെയ്യാം?

# faqA17
source: You can update the app from the App Store or Google Play Store.
ar: يمكنك تحديث التطبيق من متجر التطبيقات (Google Play أو App Store).
ml: പ്ലേ സ്റ്റോറിൽ നിന്നോ ആപ്പ് സ്റ്റോറിൽ നിന്നോ അപ്‌ഡേറ്റ് ചെയ്യാം.

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية
ml: സ്വകാര്യതാ നയം

source: Last Updated
ar: آخر تحديث
ml: അവസാനമായി അപ്‌ഡേറ്റ് ചെയ്തത്

# privacyIntroTitle
source: 1. Introduction
ar: مقدمة
ml: 1. ആമുഖം

# privacyIntroContent
source: Welcome to CashFlow. We respect your privacy and are committed to protecting your personal data. This privacy policy explains how we handle your information when you use our app.
ar: نحن نأخذ خصوصيتك على محمل الجد. تشرح سياسة الخصوصية هذه كيفية جمعنا واستخدامنا وحمايتنا لمعلوماتك.
ml: കാഷ്ഫ്ലോയിലേക്ക് സ്വാഗതം. നിങ്ങളുടെ സ്വകാര്യതയെ ഞങ്ങൾ മാനിക്കുന്നു.

# privacyDataCollectionTitle
source: 2. Data Collection
ar: جمع البيانات
ml: 2. ഡാറ്റ ശേഖരണം

# privacyDataCollectionContent
source: CashFlow stores all your financial data locally on your device. We do not collect, transmit, or store any of your personal information on external servers. The data you enter, including: • Account information • Transaction details • Personal profile information • Notification preferences All remain exclusively on your device.
ar: نحن لا نجمع أي بيانات شخصية. يتم تخزين جميع بياناتك محلياً على جهازك.
ml: കാഷ്ഫ്ലോ നിങ്ങളുടെ സാമ്പത്തിക വിവരങ്ങൾ ഫോണിൽ മാത്രമാണ് സൂക്ഷിക്കുന്നത്. ഞങ്ങൾ ഇത് ശേഖരിക്കുന്നില്ല.

# privacyDataStorageTitle
source: 3. Data Storage
ar: تخزين البيانات
ml: 3. ഡാറ്റ സംഭരണം

# privacyDataStorageContent
source: Your data is stored in a local SQLite database on your device. This database is encrypted and protected by your device's security features. We do not have access to this data.
ar: يتم تخزين جميع بياناتك بشكل آمن على جهازك. نحن لا نقوم بتحميل بياناتك إلى أي خوادم سحابية.
ml: നിങ്ങളുടെ ഡാറ്റ എൻക്രിപ്റ്റ് ചെയ്ത ഡാറ്റാബേസിൽ ഫോണിൽ സൂക്ഷിക്കുന്നു.

# privacyDataSharingTitle
source: 4. Data Sharing
ar: مشاركة البيانات
ml: 4. ഡാറ്റ പങ്കിടൽ

# privacyDataSharingContent
source: We do not share, sell, or transmit your data to any third parties. Your financial information remains private and under your control. The only way data leaves your device is when you explicitly export reports.
ar: نحن لا نشارك بياناتك مع أي طرف ثالث.
ml: ഞങ്ങൾ നിങ്ങളുടെ ഡാറ്റ ആരുമായും പങ്കിടുന്നില്ല.

# privacyPermissionsTitle
source: 5. Permissions
ar: الأذونات
ml: 5. അനുമതികൾ

# privacyPermissionsContent
source: The app may request the following permissions: • Storage: To save exported PDF reports • Notifications: To send you reminders (if enabled) These permissions are used solely for the stated purposes and do not involve data collection.
ar: قد يطلب التطبيق أذونات معينة ليعمل بشكل صحيح (مثل الإشعارات).
ml: റിപ്പോർട്ടുകൾ സേവ് ചെയ്യാനും അറിയിപ്പുകൾ നൽകാനും മാത്രം അനുമതി ചോദിക്കുന്നു.

# privacyDataSecurityTitle
source: 6. Data Security
ar: أمان البيانات
ml: 6. ഡാറ്റ സുരക്ഷ

# privacyDataSecurityContent
source: We implement appropriate security measures to protect your data: • Local encryption • Secure database storage • No external data transmission • Regular security updates
ar: نحن نستخدم تدابير أمنية متوافقة مع معايير الصناعة لحماية بياناتك.
ml: നിങ്ങളുടെ ഡാറ്റ സുരക്ഷിതമായി സൂക്ഷിക്കാൻ ഞങ്ങൾ എല്ലാ മുൻകരുതലുകളും എടുക്കുന്നു.

# privacyYourRightsTitle
source: 7. Your Rights
ar: حقوقك
ml: 7. നിങ്ങളുടെ അവകാശങ്ങൾ

# privacyYourRightsContent
source: You have complete control over your data: • Access: View all your data within the app • Modify: Edit or delete any information • Export: Generate PDF reports • Delete: Remove all data using the reset option
ar: لديك الحق في الوصول إلى بياناتك وتعديلها وحذفها في أي وقت.
ml: നിങ്ങളുടെ ഡാറ്റയിൽ നിങ്ങൾക്ക് പൂർണ്ണ നിയന്ത്രണമുണ്ട്. അത് കാണാനും മാറ്റാനും നീക്കം ചെയ്യാനും നിങ്ങൾക്ക് അവകാശമുണ്ട്.

# privacyChildrenTitle
source: 8. Children's Privacy
ar: خصوصية الأطفال
ml: 8. കുട്ടികളുടെ സ്വകാര്യത

# privacyChildrenContent
source: Our app is not directed to children under 13. We do not knowingly collect data from children.
ar: هذا التطبيق غير موجه للأطفال دون سن 13 عاماً.
ml: ഈ ആപ്പ് കുട്ടികൾക്ക് വേണ്ടിയുള്ളതല്ല.

# privacyChangesTitle
source: 9. Changes to Privacy Policy
ar: التغييرات على هذه السياسة
ml: 9. സ്വകാര്യതാ നയത്തിലെ മാറ്റങ്ങൾ

# privacyChangesContent
source: We may update this privacy policy from time to time. We will notify you of any changes by updating the "Last Updated" date.
ar: قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سيتم إشعارك بأي تغييرات.
ml: ഞങ്ങൾ ഈ നയം കാലാകാലങ്ങളിൽ പുതുക്കിയേക്കാം.

# privacyContactTitle
source: 10. Contact Us
ar: اتصل بنا
ml: 10. ഞങ്ങളെ ബന്ധപ്പെടുക

# termsAcceptanceTitle
source: 1. Acceptance of Terms
ar: قبول الشروط
ml: 1. നിബന്ധനകൾ അംഗീകരിക്കുന്നു

# termsAcceptanceContent
source: By downloading, installing, or using CashFlow, you agree to be bound by these Terms and Conditions. If you do not agree to these terms, please do not use the app.
ar: باستخدام هذا التطبيق، فإنك توافق على الالتزام بهذه الشروط والأحكام.
ml: ഈ ആപ്പ് ഉപയോഗിക്കുന്നതിലൂടെ നിങ്ങൾ നിബന്ധനകൾ അംഗീകരിക്കുന്നു.

# termsLicenseTitle
source: 2. License
ar: الترخيص
ml: 2. ലൈസൻസ്

# termsLicenseContent
source: We grant you a limited, non-exclusive, non-transferable license to use CashFlow for personal, non-commercial purposes. You may not: • Modify or reverse engineer the app • Distribute or sell copies of the app • Remove any copyright or proprietary notices • Use the app for illegal purposes
ar: نمنحك ترخيصاً محدوداً وغير حصري لاستخدام التطبيق لأغراض شخصية.
ml: വ്യക്തിപരമായ ആവശ്യങ്ങൾക്ക് മാത്രമേ ഈ ആപ്പ് ഉപയോഗിക്കാവൂ.

# termsUserRespTitle
source: 3. User Responsibilities
ar: مسؤوليات المستخدم
ml: 3. ഉത്തരവാദിത്തങ്ങൾ

# termsUserRespContent
source: You are responsible for: • Maintaining the accuracy of your financial data • Keeping your device secure • Backing up your data regularly • Complying with applicable laws and regulations
ar: أنت مسؤول عن الحفاظ على سرية معلومات حسابك.
ml: നിങ്ങളുടെ ഡാറ്റയുടെ കൃത്യതയ്ക്കും സുരക്ഷയ്ക്കും നിങ്ങൾക്കാണ് ഉത്തരവാദിത്തം.

# termsDisclaimerTitle
source: 4. Disclaimer of Warranties
ar: إخلاء المسؤولية
ml: 4. നിരാകരണം

# termsDisclaimerContent
source: CashFlow is provided "as is" without warranties of any kind. We do not guarantee that: • The app will be error-free or uninterrupted • All features will work on all devices • The app will meet your specific requirements • Data will never be lost (please backup regularly)
ar: يتم توفير التطبيق 'كما هو' دون أي ضمانات من أي نوع.
ml: ഈ ആപ്പ് "ഉള്ളതുപോലെ" നൽകുന്നു. ഇതിൽ പിശകുകൾ ഉണ്ടാകാം.

# termsLiabilityTitle
source: 5. Limitation of Liability
ar: تحديد المسؤولية
ml: 5. ബാധ്യത

# termsLiabilityContent
source: To the maximum extent permitted by law, we shall not be liable for: • Any loss of data or financial information • Indirect, incidental, or consequential damages • Any damages arising from use or inability to use the app • Financial decisions made based on app data
ar: لن نكون مسؤولين عن أي أضرار تنشأ عن استخدامك للتطبيق.
ml: ഡാറ്റ നഷ്ടപ്പെടുന്നതിനോ മറ്റ് നാശനഷ്ടങ്ങൾക്കോ ഞങ്ങൾ ഉത്തരവാദികളല്ല.

# termsAdviceTitle
source: 6. Financial Advice Disclaimer
ar: لا توجد نصيحة مالية
ml: 6. സാമ്പത്തിക ഉപദേശം

# termsAdviceContent
source: CashFlow is a tool for tracking and organizing your finances. It does not provide financial, investment, or tax advice. Always consult with qualified professionals for financial decisions.
ar: المعلومات المقدمة في التطبيق هي لأغراض إعلامية فقط ولا تشكل نصيحة مالية.
ml: ഇത് സാമ്പത്തിക ഉപദേശമല്ല. വിദഗ്ധരുമായി കൂടിയാലോചിക്കുക.

# termsAccuracyTitle
source: 7. Data Accuracy
ar: دقة المعلومات
ml: 7. ഡാറ്റ കൃത്യത

# termsAccuracyContent
source: While we strive to provide accurate calculations and reports, you are responsible for verifying all financial data. We are not liable for any errors in calculations or reports.
ar: نحن نسعى لضمان دقة المعلومات ولكن لا نضمن خلوها من الأخطاء.
ml: കണക്കുകൾ കൃത്യമാണെന്ന് ഉറപ്പുവരുത്തുക.

# termsUpdatesTitle
source: 8. Updates and Modifications
ar: التحديثات
ml: 8. അപ്‌ഡേറ്റുകൾ

# termsUpdatesContent
source: We reserve the right to: • Update or modify the app at any time • Add or remove features • Change these terms and conditions • Discontinue the app (with reasonable notice)
ar: قد نقوم بتحديث التطبيق والشروط من وقت لآخر.
ml: ഞങ്ങൾ ആപ്പ് പുതുക്കിയേക്കാം.

# termsIPTitle
source: 9. Intellectual Property
ar: الملكية الفكرية
ml: 9. ബൗദ്ധിക സ്വത്തവകാശം

# termsIPContent
source: All content, features, and functionality of CashFlow are owned by us and protected by copyright, trademark, and other intellectual property laws.
ar: جميع الحقوق والملكية الفكرية للتطبيق مملوكة لنا.
ml: എല്ലാ ഉള്ളടക്കവും ഞങ്ങളുടെ ഉടമസ്ഥതയിലാണ്.

# termsTerminationTitle
source: 10. Termination
ar: الإنهاء
ml: 10. അവസാനിപ്പിക്കൽ

# termsTerminationContent
source: You may stop using the app at any time by uninstalling it. We reserve the right to terminate or restrict access to the app for violation of these terms.
ar: يجوز لنا إنهاء وصولك إلى التطبيق في أي وقت.
ml: നിങ്ങൾക്ക് എപ്പോൾ വേണമെങ്കിലും ആപ്പ് ഉപയോഗിക്കുന്നത് നിർത്താം.

# termsGoverningTitle
source: 11. Governing Law
ar: القانون الحاكم
ml: 11. നിയമം

# termsGoverningContent
source: These terms shall be governed by and construed in accordance with applicable local laws, without regard to conflict of law provisions.
ar: تخضع هذه الشروط لقوانين الولاية القضائية التي نعمل فيها.
ml: പ്രാദേശിക നിയമങ്ങൾ ബാധകമാണ്.

# termsContactTitle
source: 12. Contact Information
ar: اتصل بنا
ml: 12. ബന്ധപ്പെടുക

# termsContactContent
source: For questions about these terms, please contact us through the app's support section.
ar: إذا كان لديك أي أسئلة حول هذه الشروط، يرجى الاتصال بنا.
ml: സംശയങ്ങൾക്ക് ഞങ്ങളെ ബന്ധപ്പെടുക.

# termsFooter
source: By using CashFlow, you acknowledge that you have read, understood, and agree to be bound by these Terms and Conditions.
ar: شكراً لاستخدامك CashFlow!
ml: കാഷ്ഫ്ലോ ഉപയോഗിക്കുന്നതിലൂടെ നിങ്ങൾ നിബന്ധനകൾ അംഗീകരിക്കുന്നു.

# loginWelcome
source: Welcome to CashFlow
ar: مرحبًا بك في CashFlow
ml: കാഷ്ഫ്ലോയിലേക്ക് സ്വാഗതം

# loginSubtitle
source: Sign in to continue
ar: تسجيل الدخول للمتابعة
ml: തുടരാൻ ലോഗിൻ ചെയ്യുക

# whyLoginTitle
source: Why Login?
ar: لماذا تسجيل الدخول؟
ml: എന്തുകൊണ്ട് ലോഗിൻ ചെയ്യണം?

# whyLoginContent
source: Even though your data is stored locally on your device, we use a login system to secure your financial information from unauthorized access by others who might use your phone.
ar: على الرغم من أن بياناتك مخزنة محليًا على جهازك، فإننا نستخدم نظام تسجيل الدخول لتأمين معلوماتك المالية من الوصول غير المصرح به من قبل الآخرين الذين قد يستخدمون هاتفك.
ml: നിങ്ങളുടെ ഡാറ്റ നിങ്ങളുടെ ഉപകരണത്തിൽ പ്രാദേശികമായി സംഭരിച്ചിട്ടുണ്ടെങ്കിലും, നിങ്ങളുടെ ഫോൺ ഉപയോഗിക്കുന്ന മറ്റുള്ളവരിൽ നിന്ന് നിങ്ങളുടെ സാമ്പത്തിക വിവരങ്ങൾ സുരക്ഷിതമാക്കാൻ ഞങ്ങൾ ഒരു ലോഗിൻ സംവിധാനം ഉപയോഗിക്കുന്നു.

# whyLoginAction
source: Got it
ar: فهمت
ml: മനസ്സിലായി
